trade_exp/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РасходыПоОбъектам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>350</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="320b124d-3c29-46e8-853c-ed5d358989bd">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="99d7a7fd-337f-4df2-a907-098ecb6044e6">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df20af94-0e4b-4c14-855e-7d1648302512">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="907c98f6-3522-4fae-9297-7d6f8a4c34d3">
    <name>ПутевыеЛисты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/СобытияДокументовАльтерра/СобытияДокументовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3e883146-7b48-4081-a003-71ee5e8f1efb">
  <name>СобытияДокументовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes extendedConfigurationObject="75c3f75b-2122-4ca4-882f-2a48b8400bb0">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8dba71fd-f575-4686-9841-236c53c988bc">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d2a1c204-387f-4476-88e2-11c124366a2b">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СобытияДокументов/СобытияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="68d6e93c-c08c-4a2c-a2b4-74e34cede88a">
  <name>СобытияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="ea63a5b9-c6c8-4de9-97c2-7e462421354e">
    <name>УведомлениеПодрядчикуВысланоПовторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6869b05a-3d71-476e-ada5-b56e83c13439">
    <name>М15ОтправленаПодрядчику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7ff3d464-1eb5-4d23-a98e-3f5a7d8e1ca3">
    <name>УведомлениеПодрядчику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fe5a6abc-f03c-472d-b2a0-61bb72aa74d4">
    <name>ТребуетсяПовторноеУведомлениеПодрядчику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ВнутреннееПотребление/Forms/ФормаДокумента/Module.bsl
#Область ЗаполнениеОстаткамиНаСкладе
&НаКлиенте
Процедура Док_ЗаполнитьОстаткамиНаСкладеПосле(Команда)
	
	Если Не ЭтоТорговыйСклад(Объект.Склад) Тогда
		ЗаполнитьОстаткамиПоСкладу(Объект.Склад);
	Конецесли;
	
КонецПроцедуры

Функция ЭтоТорговыйСклад(ТекСклад)
	 Возврат ТекСклад.СкладПродажи;
КонецФункции 

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
	УведомленияПодрядчику_ИнициализацияЗначений();
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
	УведомленияПодрядчику_ИнициализацияЗначений();
КонецПроцедуры

&НаСервере
Процедура ВидимостьКнопкиЗаполненияОстатками(Склад)
	
	Если Не Склад.Пустая() Тогда
    	Элементы.ЗаполнитьОстатками.Доступность = Не ЭтоТорговыйСклад(Склад);
	Иначе
    	Элементы.ЗаполнитьОстатками.Доступность = Ложь;
	Конецесли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиПоСкладу(Склад)
		
	Результат = АльтерраОбщегоНазначения.ПолучитьОстаткиПоСкладу(Склад);
		
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("На данном складе нет доступных остатков");
	Иначе
		Объект.Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Зеленение

&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

&НаСервере
Процедура СКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Элементы._ГруппаСекции.Видимость=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
	ЭтаФорма.Элементы.Кладовщик.Доступность=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
КонецПроцедуры 

&НаКлиенте
Процедура СброситьПоСекции(Команда)
	
	МассивВыдСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивВыдСтрок.Количество() <> 0 Тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик = "";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередУдалениемПосле(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) Тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередНачаломИзмененияПосле(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Изменение строки запрещено!!!");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти


#Область СтатьяРасходовБУ

&НаКлиенте
Процедура Док_ТоварыСтатьяРасходовБУНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.Товары.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.Товары.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.Товары.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Строка.СтатьяРасходовБУ = Результат; 
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьСтатьюРасходовБУПосле(Команда)
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Объект.Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Товары"" не введено ни одной строки.'"));
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В списке ""Товары"" не выделено ни одной строки.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборДляЗаполненияЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.Товары.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элементы.ТоварыСтатьяРасходовБУ.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборДляЗаполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Товары.ВыделенныеСтроки);
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(Строка);
		ДанныеСтроки.СтатьяРасходовБУ = Результат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыСтатьяРасходовПриИзмененииПосле(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	Если Не значениезаполнено(СтрокаТаблицы.СтатьяРасходовБУ) Тогда
		СтрокаТаблицы.СтатьяРасходовБУ = СтрокаТаблицы.СтатьяРасходов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УведомленияПодрядчику

&НаСервере
Процедура УведомленияПодрядчику_ИнициализацияЗначений()
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СобытияДокументовАльтерраСрезПоследних.Документ КАК Документ,
	               |	СобытияДокументовАльтерраСрезПоследних.Событие КАК Событие
	               |ИЗ
	               |	РегистрСведений.СобытияДокументовАльтерра.СрезПоследних КАК СобытияДокументовАльтерраСрезПоследних
	               |ГДЕ
	               |	СобытияДокументовАльтерраСрезПоследних.Документ = &Документ
	               |	И СобытияДокументовАльтерраСрезПоследних.Событие = &Событие";
	Запрос.УстановитьПараметр("Документ",объект.Ссылка);
	Запрос.УстановитьПараметр("Событие",Перечисления.СобытияДокументов.УведомлениеПодрядчику); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ДокументОтправлен = Истина; 
	Иначе
		 ДокументОтправлен = ложь; 
	КонецЕсли; 

	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если (ЗначениеЗаполнено(Объект.Склад) И 
		ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И 
		Объект.Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		Объект.Склад.ОтправкаУведомлений = Истина И
		Объект.Склад.ТипСкладаПодрядчика = Истина)
	Тогда  
		Элементы.УведомленияПодрядчику.Видимость = ИСТИНА;
		УведомленияПодрядчикуТелефон = Объект.Склад.ТелефонПодрядчика; 
		УведомленияПодрядчикуПочта = Объект.Склад.EMAILподрядчика;
	Иначе
		Элементы.УведомленияПодрядчику.Видимость = ЛОЖЬ;
	КонецЕсли;
		
КонецПроцедуры       

&НаКлиенте
Процедура ПослеЗакрытияВопросаПовторный(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		 ПроверкаНастроекСклада("3");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПервичный(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		 ПроверкаНастроекСклада("2");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНастроекСклада(Код)
	
	Если Код = "2" Тогда 
		Если Объект.Склад.ОтправкаУведомлений ТОгда 
			 ОтправкаУведомленийПодрядчику("2");
		Иначе
			 Сообщить("У подрядчика не настроенно получение уведомлений"); 
		КонецЕсли;
	КонецЕсли;
	 
	Если Код = "3" Тогда 
		Если Объект.Склад.ПовторноеУведомление ТОгда 
			 ОтправкаУведомленийПодрядчику("3");
		Иначе
			 Сообщить("У подрядчика не настроенно получение повторных уведомлений"); 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура Док_ОтправитьУведомлениеПодрядчикуПосле(Команда)
	
	Если ДокументОТправлен Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПовторный",
		      ЭтотОбъект);	
		 
		    ПоказатьВопрос(Оповещение,
		        "Повторно уведомить подрядчика о списание товаров с его склада?",
		        РежимДиалогаВопрос.ДаНетОтмена,
		        0);   
	КонецЕсли;		
	 
	Если Не ДокументОТправлен Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПервичный",
		  ЭтотОбъект);	
	 
	    ПоказатьВопрос(Оповещение,
	        "Уведомить подрядчика о списании товаров с его склада? ",
	        РежимДиалогаВопрос.ДаНетОтмена,
	        0);

	КонецЕсли; 
	
КонецПроцедуры
	
Процедура ОтправкаУведомленийПодрядчику(Код)
	
	СправочникСклады_ГруппаПодрядчики = Справочники.Склады.НайтиПоНаименованию("Подрядчики");
	Если ЗначениеЗаполнено(Объект.Склад) И 
		ЗначениеЗаполнено(СправочникСклады_ГруппаПодрядчики) И 
		Объект.Склад.ПринадлежитЭлементу(СправочникСклады_ГруппаПодрядчики) И
		Объект.Склад.ОтправкаУведомлений = Истина И
		Объект.Склад.ТипСкладаПодрядчика = Истина 
	Тогда 
		ОтправитьСМСиEmail(Код);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтправитьСМСиEmail(Код)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ должен быть записан!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
		ОбщегоНазначения.СообщитьПользователю("Номер документа должен быть указан!");
		Возврат;
	КонецЕсли;
	
	ФайлОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатные формы списания", Истина);

	ФайлОбработка2 = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Печатные формы списания", Истина);

	Если Не ЗначениеЗаполнено(ФайлОбработка2) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка! Не найдена доп. обработка 'Печатные формы списания'..");
		Возврат;
	КонецЕсли;
	МассивСкладов = Новый Массив; 
	УведомленияПодрядчикуПочта = Объект.Склад.EMAILподрядчика;
	УведомленияПодрядчикуТелефон = Объект.Склад.ТелефонПодрядчика;
	ДопПочта = Объект.Склад.ДопEMAILподрядчика; 
	МассивСкладов.Добавить(Объект.Склад); 
	МассивСкладов.Добавить(Объект.Склад.ДопСкладПодрядчика);
	
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьСумму", Истина);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(Объект.Ссылка);
	
	ДвоичныеДанные = ФайлОбработка.ХранилищеОбработки.Получить();
	ФайлОбработка = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ФайлОбработка);
	
	ДвоичныеДанные2 = ФайлОбработка2.ХранилищеОбработки.Получить();
	ФайлОбработка2 = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные2.Записать(ФайлОбработка2);

	
	СуммаИтог = 0;
	ТабличныйДокумент = ВнешниеОбработки.Создать(ФайлОбработка).СформироватьПечатнуюФормуНакладнаяНаПеремещениеПодрядчику(МассивДокументов, ОбъектыПечати, ПараметрыПечати, СуммаИтог);
	ФайлТабДок = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ФайлТабДок, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок));
	
	ТабличныйДокумент2 = ВнешниеОбработки.Создать(ФайлОбработка2).СформироватьПечатнуюФормуВедомостьОстатковНаСкладах(Объект.Ссылка, МассивСкладов);
	ФайлТабДок2 = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент2.Записать(ФайлТабДок2, ТипФайлаТабличногоДокумента.XLSX);
	АдресВХ2 = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТабДок2));

		
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище","Ведомость по остаткам на складе" + ".xlsx", АдресВХ2));
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Списание ТМЦ на " +  ".xlsx", АдресВХ));
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("Кому", УведомленияПодрядчикуПочта);
	Если код = "2" Тогда //1 Списание с договорного поставщика
		ПараметрыОтправки.Вставить("Тема", "Альтерра списание ТМЦ на " + Объект.Склад);
		ПараметрыОтправки.Вставить("Тело", "С вашего склада '" + Объект.Склад + " от " +ТекущаяДата() + "' списаны ТМЦ .№" + Объект.Номер + ". Документы прилагаются.");
	КонецЕсли;
	Если код = "3" Тогда //Повторное списание с договорного поставщика
		ПараметрыОтправки.Вставить("Тема", "Альтерра изменение списания ТМЦ на " + Объект.Склад);
		ПараметрыОтправки.Вставить("Тело", "На вашем складе '" + Объект.Склад + "' " + ТекущаяДата() +  " изменился состав списания ТМЦ №" + объект.Номер + " . Документы прилагаются.");
	КонецЕсли;
	
	ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8);
	ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправки.Вставить("Вложения", МассивФайлов);
	
	РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	
	Если ЗначениеЗАполнено(ДопПочта) Тогда 
		ПараметрыОтправки.Кому = ДопПочта; 
		РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	КонецЕслИ; 
	

	Если ЗначениеЗаполнено(РезультатОтправкиEmail) И ТипЗнч(РезультатОтправкиEmail) = Тип("Строка") Тогда	
		НомерТелефонаПартнера = АльтерраОбщегоНазначения.ПолчитьТелефонБезКода(УведомленияПодрядчикуТелефон);
		Если СтрДлина(НомерТелефонаПартнера) = 10 Тогда
			СтрокаНомерТелефона = "+7" + Строка(НомерТелефонаПартнера);
			СтатусОшибки = Ложь;
			Если код = "2" Тогда //1 Перемещение с договорного поставщика
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "Со скл '" + объект.Склад + " списаны ТМЦ по док " + объект.Номер + " на сум."+ СуммаИтог + "р. Отпр.'" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			КонецЕсли;
			Если код = "3" Тогда //Повторное перемещение с договорного поставщика
				АльтерраОбщегоНазначения.ОтправитьСМС(СтрокаНомерТелефона, "Изм. в списании " +объект.Номер + " на скл '" + объект.Склад + "' Нов. сумма " +СуммаИтог + "р. Отпр. '" + УведомленияПодрядчикуПочта + "'", СтатусОшибки);
			КонецЕсли;

	
			Если Не СтатусОшибки Тогда
				ОбщегоНазначения.СообщитьПользователю("Сообщения на E-mail адрес и телефон успешно отправлены!");	
			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на телефон. На E-mail адрес сообщение успешно отправлено!");
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение на E-mail адрес..");
	КонецЕсли;
	
	УдалитьФайлы(ФайлОбработка2);
	УдалитьФайлы(ФайлТабДок2);
	УдалитьИзВременногоХранилища(АдресВХ2);
	Если КОД = "2" Тогда 
		События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
		События.Отбор.Документ.Установить(объект.Ссылка); 
		События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчику); 
		
		НовоеСобытие = События.Добавить();
		НовоеСобытие.Документ = объект.Ссылка;
		НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчику;
		НовоеСобытие.Период = ТекущаяДата(); 
		События.Записать();
	КонецЕсли;
	
	Если Код = "3" Тогда 
		  		  
		События = РегистрыСведений.СобытияДокументовАльтерра.СоздатьНаборЗаписей();
		События.Отбор.Документ.Установить(объект.Ссылка); 
		События.Отбор.Событие.Установить(Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно); 
		
	    НовоеСобытие = События.Добавить();
		НовоеСобытие.Документ = объект.Ссылка;
		НовоеСобытие.Событие = Перечисления.СобытияДокументов.УведомлениеПодрядчикуВысланоПовторно;
		НовоеСобытие.Период = ТекущаяДата(); 
		События.Записать();

	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Док_УстановитьОбъектРасходовПосле(Команда)

	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Объект.Товары.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для выполнения команды требуется выделить строки табличной части.'"));
		Возврат;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
	
	ВыбранноеЗначение = Неопределено;
	
	ОткрытьФорму(
		"Общаяформа.ФормаВыбораОбъектовАналитики", 
		СтруктураПараметры,
		ЭтаФорма,,,, Новый ОписаниеОповещения("УстановитьОбъектРасходовЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбъектРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    
    ВыбранноеЗначение = Результат;
    
    Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
        
        Для Каждого Строка Из ВыделенныеСтроки Цикл
            
            СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(Строка);
            Если СтрокаТаблицы <> Неопределено Тогда
                СтрокаТаблицы.ОбъектРасходов = ВыбранноеЗначение.ОбъектРасходов;
                СтрокаТаблицы.АналитикаОбъекта = ВыбранноеЗначение.АналитикаОбъекта;
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
